[
  {
    "title": "Data Integration Services",
    "content": "Data Connectors to connect with 25+ databases and 3 flat files\n\nFull Page Text:\nHome\nProduct\nResources\nContact Us\nLogin\nEnglish\nEnglish\nहिन्दी\nDATA INTEGRATION, EXPLORATION & VISUALISATION PLATFORM\nis an open-source, enterprise-ready Data Integration, Exploration & Visualisation Platform that collects and processes data by providing an intuitive and easy-to-use interface for collecting data, creating and sharing data visualisations ranging from simple pie charts to intricate decks, dashboards, and reports. Its ability to connect and work with a wide variety of data sources and cloud storage services makes it highly scalable and customisable.\nBook a demo\nat a Glance\n- A Data Integration, Exploration & Visualisation Platform, that helps process and analyse data and turn it into actionable insights for better-informed decisions.\nOpen-Source\nTechnology\nOpen-source tools reduce the perceived long-term risk of vendor lock-in or vendor closing down\nEnhanced\nData Quality\nEnsure data accuracy and consistency by providing a single, unified view of an organization's data\nData Source\nConnectivity\nData Connectors to connect with 25+ databases and 3 flat files\nImproved\nDecision Making\nAccurate, up-to-date information that can be used to make better, more informed decisions\nCustomisable\nDashboards\nHighly customisable dashboards to tailor specific needs of the organizations\nIncreased\nProductivity\nEasily access and analyze data, which leads to increased productivity and efficiency\nBridging Gaps Between\nData\nand\nDecisions\nAccelerated\nanalysis and reporting\nHighly scalable for\nbuilder and developers\nRole-based access control to limit access to sensitive data\nAdmins\nAdministrating workspaces and report publishing\nManaging permissions and users access to data, reports, and dashboards\nCreators\nFast-track data shaping capabilities\nAdvanced analytics\nViewers\nSlice and dice the data by selecting cross filters across the visuals\nEasy report sharing to teams"
  },
  {
    "title": "Welcome to NICSI | Home",
    "content": "Contact: +91-11-26105054, +91-11-22900523, +91-11-22900525,\n8527625551\n1\n2\n3\n4\n5\nNational Informatics Centre Services Inc. (NICSI) was established in 1995 as a section-25 (now section 8 company under the Companies Act, 2013) company under National Informatics Centre, Ministry of Electronics & Information Technology, Government of India for providing and procuring IT solutions for multiple e-governance projects undertaken by NIC, MeitY, Governments and Government Organizations (like Public Sector Undertakings).\n2011\n30,000 sq ft\n462 Racks\n2008\n16,000 sq ft\n62 Racks\n2010\n10,000 sq ft\n154 Racks\n2010\n10,000 sq ft\n171 Racks\n2018\n25,885 sq ft\n271 Racks\nPage Last Updated on: 02-06-2025\nTotal no. of visitors : 558379 (Since 11 February 2023)\n2011\n30,000 sq ft\n462 Racks\n2008\n16,000 sq ft\n62 Racks\n2010\n10,000 sq ft\n154 Racks\n2010\n10,000 sq ft\n171 Racks\n2018\n25,885 sq ft\n271 Racks\n\nFull Page Text:\nSitemap\nScreen Reader Access\nSkip To Main Content\nA-\nA\nA+\nEnglish\nहिन्दी\nProfile\nAbout NICSI\nOrganization\nOrganization Chart\nHeadquarters Personnel\nState Personnel\nWork Allocation\nBoard of Directors\nList of Chairpersons\nList of Managing Directors\nProjects\nNational Projects\nInternational Projects\nNICSI Cloud\nPartners\nTenders\nActive Tenders\nDownloads\nNICSI SOP\nCircular & Notices\nForms\nReports\nMedia\nPhotos\nVideos\nRTI\nGST Particulars\nCSR\nCareer\nContact Us\nContact: +91-11-26105054, +91-11-22900523, +91-11-22900525,\n8527625551\nPrevious\nNext\n1\n2\n3\n4\n5\nTwitter\nLinkedin\nInstagram\nWhatsApp\nAbout\nNICSI\nNational Informatics Centre Services Inc. (NICSI) was established in 1995 as a section-25 (now section 8 company under the Companies Act, 2013) company under National Informatics Centre, Ministry of Electronics & Information Technology, Government of India for providing and procuring IT solutions for multiple e-governance projects undertaken by NIC, MeitY, Governments and Government Organizations (like Public Sector Undertakings).\nView\n\t\t\t\t\t\t\t\t\t\t\t\tMore\nAnnouncements\nProcurement Requisition Form- Bid\nOur Core Services\nCentre of Excellence for Data Analytics (CEDA)\nView\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tMore\nProductization & International Promotion\nView\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tMore\nData Centre Services\nView More\nSoftware and Website Development\nView More\nManpower Services\nView More\nIT Consultancy\nView More\nRollout Services\nView More\nProcurement &\nGeM Services\nView\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tMore\nTraining Services\nView More\nVideo Conferencing\nView More\nWorkspace Development Services\nView More\nCall Centre Services\nView More\nMedia\nPhotos\nVideos\nPosters\nView\n\t\t\t\t\t\t\t\t\t\t\t\tMore\nView\n\t\t\t\t\t\t\t\t\t\t\t\tMore\nDownload\nDownload\nDownload\nDownload\nNICSI Feeds\nTwitter\nLinkedin\nInstagram\nView\nData Centre Services\n×\nNational Data Centre Shastri Park\nThis Data Centre is housed at the first floor of DMRC IT Park, Shastri Park, New Delhi.\nEstablished :\n2011\nType :\nTier-III\nArea :\n30,000 sq ft\nCapacity :\n462 Racks\nLaxmi Nagar Data Centre Delhi\nNICSI has built a Data Centre in SCOPE Minar loacated at Laxmi Nagar, Delhi.\nEstablished :\n2008\nType :\nTier-II (*)\nArea :\n16,000 sq ft\nCapacity :\n62 Racks\n(*)Under process for Tier-III\nNational Data Centre - Hyderabad\nDue to increasing requirement of high availability and reliability of mission mode critical applications, NIC has set up a NDC at Hyderabad.\nEstablished :\n2010\nType :\nTier-III\nArea :\n10,000 sq ft\nCapacity :\n154 Racks\nNational Data Centre - Pune\nTo meet the requirement of high availability and reliability of mission critical applications, NIC has set up a National Data Centre (NDC) at Pune.\nEstablished :\n2010\nType :\nTier-III\nArea :\n10,000 sq ft\nCapacity :\n171 Racks\nNational Data Centre - Bhubaneswar\nDue to increasing requirement, NIC has setup a new state of the art National Data Centre-BHUBANESWAR.\nEstablished :\n2018\nType :\nTier-III\nArea :\n25,885 sq ft\nCapacity :\n271 Racks\nSoftware and Website Development\n×\nNICSI provides software and website development services to the Ministries/Departments and PSUs via its empanelled vendors with its state-of-the-art development methodologies, adapting the SDLC life cycle framework to meet the requirements of the user department. NICSI has been creating compelling experiences to uphold the standards of excellence and maintainability for the best interest of the user department and stakeholders.\nManpower Services\n×\nNICSI provides NICSI-certified eGov Technical/Management consultants services based on Ministry/Govt. Department requirements via its empanelled vendors on a project and manpower basis for the further development of existing services, technologies, infrastructure, and expertise. NICSI also provides Technical & Core Competency Support Services for various ICT Projects and National Data Centre, manpower for website development and applications, UI/UX and Creative Designing, Management of Social Media and Digital Presence, Facility Management Services (FMS) for NICNET and Networks managed by NIC, etc.\nIT Consultancy\n×\nNICSI’s Consulting services are complemented by a range of experience, portfolio,\n                            capabilities in Technology as well as operational management capabilities. NICSI supports\n                            Government User Departments/ Ministries/ PSUs in achieving objectives/goals of their Schemes\n                            & Programmes.\nNICSI helps in several ways including:\nProviding relevant and accessible consulting grounded in today’s best practices and\n                                compliance requirements\nProviding a talented and experienced consulting team to work alongside User Department’s\n                                team\nAugmenting User Department’s existing team with specialist skills or extending the\n                                broader capacity and capability, giving a headroom to grow\nImproving existing programs effectiveness and capability\nProvides User Departments with external Subject Matter Experts (SMEs) performing the\n                                same activities, as traditional onsite consulting addressing varying needs and budgetary\n                                considerations\nRollout Services\n×\nNICSI offers the Rollout of eGov Software Products that bring together the independent functions and systems under a single framework. NICSI by Leveraging business opportunities has  successfully rolled out NIC/NICSI's e-Governance products in foreign countries like eOffice and eHospital applications to support smooth operation by ushering in more effective and transparent inter and intra-operating processes which addresses all the major functional areas of the user departments.\nTraining Services\n×\nThe Digital India vision provides the intensified impetus for momentum and progress for e-Governance initiatives and to meet this vision, it is required to build adequate and relevant capacities at all levels. Success of the guidelines depend on their effective implementation which includes plans for developing programs related to capacity building, training, hand holding and towards sensitization of the departments in the adoption and implementation of these guidelines. With the above-mentioned view, NIC/NICSI provides both General Computer Training & Application specific Training services. The Training and Workshop curriculum has been diligently prepared, understanding the functions performed by the stakeholders. In addition, NIC/NICSI offer immense training opportunities in well planned and professionally managed training courses not only on various computer related topics, but also on the application of IT in key sectoral areas.\nTypes of Training Programmes:\nGovernment Informatics Training Programs\nTechnology Update Programs\nCustomized Programs for various Sectors\nVideo Conferencing\n×\nNICSI provides Video Conferencing services to various Ministries, Government Departments, and PSUs. NICSI VC service provides a secure communication with useful features which are in line with government requirements and ensures smooth interaction between multiple platforms and across the country at all levels for monitoring different government projects, schemes, public grievances, monitoring law and order situations.\nWorkspace Development Centre\n×\nNICSI provides development seats / workstations on a per-seat basis. The seats are fully equipped with workstations / computers, Internet connectivity, and other basic amenities such as table, chair, light, air conditioning, washrooms, water etc. Additional services are also available on demand for a modest fee. The cost per seat is significantly cheaper than that of other comparable Coworking space providers.\nImportant Features:\nLow Price with High Flexibility\nWorkspace With Great Location and Full Amenities\nHigher Productivity and Motivation For Your Employees\nNetwork & Collaboration Opportunities\nCall Centre Services\n×\nNICSI offers call centre/help desk services through its empanelled vendors to various Ministries, Government Departments and PSUs for the establishment and operation of help desk/call centre to support ICT Infrastructure services and e-Governance applications to handle all types of inbound queries, complaints, requests, outbound calling, and response through phone / message / web / email / messenger\n×\nADVISORY/CAUTION NOTICE\nSubject: Advisory / Caution Notice to Banks / Non-Banking Financial Institutions (NBFC) on availing Bills discounting / Credit Facility by the vendors of NICSI.\nThis is to notify all concerned that it has come to the notice of National Informatics Centre Services Incorporated (NICSI) that some Vendors of NICSI are availing Bills Discounting / Credit Facility from Banking Institutions / Non-Banking Financial Institutions (NBFC) on the invoices raised by them to NICSI without prior consent of NICSI.\nThis is to advise to all concerned that NICSI shall bear no responsibility for any loss suffered by anyone by dealing with such arrangement and the same shall be at their own risk. Further, NICSI shall not be held liable for any financial loss to Third Parties arising out of such arrangement due to non-payment of such invoices by NICSI to Vendors.\nPage Last Updated on: 02-06-2025\nTotal no. of visitors : 558379 (Since 11 February 2023)\nData Centre Services\n×\nNational Data Centre Shastri Park\nThis Data Centre is housed at the first floor of DMRC IT\n\n\t\t\t\t\t\t\t\t\t\tPark, Shastri Park, New Delhi.\nEstablished :\n2011\nType :\nTier-III\nArea :\n30,000 sq ft\nCapacity :\n462 Racks\nLaxmi Nagar Data Centre Delhi\nNICSI has built a Data Centre in SCOPE Minar loacated at\n\t\t\t\t\t\t\t\t\t\tLaxmi Nagar, Delhi.\nEstablished :\n2008\nType :\nTier-II (*)\nArea :\n16,000 sq ft\nCapacity :\n62 Racks\nNational Data Centre - Hyderabad\nDue to increasing requirement of high availability and\n\t\t\t\t\t\t\t\t\t\t\treliability of mission mode critical applications, NIC has set\n\t\t\t\t\t\t\t\t\t\t\tup a NDC at Hyderabad.\nEstablished :\n2010\nType :\nTier-III\nArea :\n10,000 sq ft\nCapacity :\n154 Racks\nNational Data Centre - Pune\nTo meet the requirement of high availability and\n\t\t\t\t\t\t\t\t\t\t\treliability of mission critical applications, NIC has set up a\n\t\t\t\t\t\t\t\t\t\t\tNational Data Centre (NDC) at Pune.\nEstablished :\n2010\nType :\nTier-III\nArea :\n10,000 sq ft\nCapacity :\n171 Racks\nNational Data Centre - Bhubaneswar\nDue to increasing requirement, NIC has setup a new state\n\t\t\t\t\t\t\t\t\t\t\tof the art National Data Centre-BHUBANESWAR.\nEstablished :\n2018\nType :\nTier-III\nArea :\n25,885 sq ft\nCapacity :\n271 Racks"
  },
  {
    "title": "Contact Us | Coe",
    "content": "15 NBCC Tower, 1st Floor, Bhikaji Cama Place,\nNew Delhi – 110066\nPhone: 011-26105054, 22900533\n\nFull Page Text:\nSkip to main content\nSkip to main content\nScreen reader access\nA-\nA\nA+\nA\nA\nहिन्दी\nContact Us\nCentre of Excellence for Data Analytics\nNational Informatics Centre Services Incorporated (NICSI)\n15 NBCC Tower, 1st Floor, Bhikaji Cama Place,\nNew Delhi – 110066\nCall us:\nPhone: 011-26105054, 22900533\nMail to us:\nceda[At]gov[Dot]in\nName\n*\nEmail Address\n*\nContact Number\n*\nOrganisation Name\n*\nMinistry Name\n*\nCentral/State/Others\n*\n- Select -\nCentral\nState\nOthers\nRequirement\n*\nWhat code is in the image?\n*\nGenerate a new captcha\nSubmit"
  },
  {
    "title": "Data Integration Services",
    "content": "Full Page Text:\nHome\nProduct\nResources\nContact Us\nLogin\nEnglish\nEnglish\nहिन्दी\nTour\nOur Products\nData integration involves the real-time, continuous collection and transfer of data, efficiently managing large volumes at scale with high throughput and minimal latency\nAnalytics Platform\nStreaming Integration for\nData Visualisation\nData Exploration\nData Integration\nExternal Data Source\nExternal Data Source\nExternal data sources refer to information obtained from outside an organization or system. These sources play a crucial role in enriching internal data, providing additional context, and expanding the scope of analysis and decision-making.\nData Integration\nEffective data integration strategies often involve selecting appropriate tools, establishing robust workflows, and ensuring data quality to derive meaningful insights and maintain a competitive edge in today's data-driven landscape.\nData Exploration\nData exploration is the preliminary phase of data analysis where analysts examine and investigate data sets to discover patterns, spot anomalies, and formulate hypotheses. It involves querying, visualizing, and summarizing data to gain insights and make informed decisions.\nData Visualisation\nData visualization is the graphical representation of data and information using visual elements such as charts, graphs, and maps. It serves the purpose of making complex data more accessible, understandable, and interpretable to facilitate decision-making and communication.\nFlexibility\nPragyan offers flexibility with a wide range of sources, destinations, and processing capabilities, ensuring it can meet various use cases and adapt to changing needs over time.\nScalability\nPragyan's architecture is tailored to manage substantial amounts of data, making it well-suited for enterprise-level stream processing requirements."
  },
  {
    "title": "Data Integration Services",
    "content": "Full Page Text:\nHome\nProduct\nResources\nContact Us\nLogin\nEnglish\nEnglish\nहिन्दी\nTour\nCreate real-time data streaming pipelines effortlessly in just minutes.\nHarness the capabilities of real-time data to drive your operations and decision-making, offered as a fully managed service on government cloud platforms.\n+\nDirect Database Connectors\n+\nChart Visualisations\n+\nDatabases\nSpeed up your\nAnalytics\nPragyan accelerates data collection, processing, and visualization to generate insights more quickly. This involves optimizing data pipelines, reducing latency in data transfers, and enabling real-time or near-real-time analytics.\nMinistry/Departments\nAccelerated\nanalysis and reporting\nCenter/States Schemes\nRole-based access control to limit access to sensitive data\nEmbedded Analytic\nData insights and visualizations directly into applications, enabling real-time, actionable insights within workflows\nDrill Down Analysis\nExplore data at any granularity for precise insights and better decision-making\nOur Database\nConnectors\nNational Data Centers (NDCs)\nNational Data Centers (NDCs)\nAmazon Athena\nAmazon Redshif\nApache Pinot\nClickhouse\nCouchbase\nCSV\nDatabricks\nDenodo\nDoris\nDremio\nDruid\nGoogle Big Query\nAdmins\nibmdb2\nMysql\nAdmins\nOracle\nPostgresql\nPresto\nRockset\nSap Hana\nSqlserver"
  },
  {
    "title": "Welcome to Coe | Coe",
    "content": "1\n2\n3\n4\n\nFull Page Text:\nSkip to main content\nSkip to main content\nScreen reader access\nA-\nA\nA+\nA\nA\nहिन्दी\nCENTRE OF EXCELLENCE FOR DATA ANALYTICS\nTURNING DATA INTO INSIGHTS\nOffering Comprehensive analysis for Effective Decision and Actions\nCENTRE OF EXCELLENCE FOR DATA ANALYTICS\nTURNING DATA INTO INSIGHTS\nCENTRE OF EXCELLENCE FOR DATA ANALYTICS\nTURNING DATA INTO INSIGHTS\nCENTRE OF EXCELLENCE FOR DATA ANALYTICS\nTURNING DATA INTO INSIGHTS\nOffering Comprehensive analysis for Effective Decision and Actions\n1\n2\n3\n4\nPrevious\nNext\nBROCHURES\nCEDA-Journey\nDownload\nPlatform & Solutions\nDownload\nPrayas\nDownload\nPragyan\nDownload\nTejas\nDownload\nFocus Areas\nDownload\nMAKING\nINTELLIGENT\nDECISIONS\nAbout Us\nWe understand, transform and analyze data to extract valuable insights that empower our clients...\nLearn More\nOur Offerings\nClick here to learn about our range of service offerings\nLearn More\nCase Studies\nSee how our existing partners have leveraged our capabilities\nLearn More\nDATA\nANALYTICS\nJOURNEY\nThe Analytics journey is a journey of progressively unraveling meaningful insights from the deluge of data. The Data Analytics journey is usually undertaken through a set of standard data driven processes that ultimately help in achieving the intended output. The...\nLearn More"
  },
  {
    "title": "Data Integration Services",
    "content": "Full Page Text:\nSign In\nEMAIL\nPASSWORD\nvisibility_off\nI27FK3\nForgot Password ?\nSign In\nDon’t have an account?\nSign Up\nGo back to home"
  },
  {
    "title": "Data Integration Services",
    "content": "Full Page Text:"
  },
  {
    "title": "Data Integration Services",
    "content": "Data Connectors to connect with 25+ databases and 3 flat files\n\nFull Page Text:\nHome\nProduct\nResources\nContact Us\nLogin\nEnglish\nEnglish\nहिन्दी\nDATA INTEGRATION, EXPLORATION & VISUALISATION PLATFORM\nis an open-source, enterprise-ready Data Integration, Exploration & Visualisation Platform that collects and processes data by providing an intuitive and easy-to-use interface for collecting data, creating and sharing data visualisations ranging from simple pie charts to intricate decks, dashboards, and reports. Its ability to connect and work with a wide variety of data sources and cloud storage services makes it highly scalable and customisable.\nBook a demo\nat a Glance\n- A Data Integration, Exploration & Visualisation Platform, that helps process and analyse data and turn it into actionable insights for better-informed decisions.\nOpen-Source\nTechnology\nOpen-source tools reduce the perceived long-term risk of vendor lock-in or vendor closing down\nEnhanced\nData Quality\nEnsure data accuracy and consistency by providing a single, unified view of an organization's data\nData Source\nConnectivity\nData Connectors to connect with 25+ databases and 3 flat files\nImproved\nDecision Making\nAccurate, up-to-date information that can be used to make better, more informed decisions\nCustomisable\nDashboards\nHighly customisable dashboards to tailor specific needs of the organizations\nIncreased\nProductivity\nEasily access and analyze data, which leads to increased productivity and efficiency\nBridging Gaps Between\nData\nand\nDecisions\nAccelerated\nanalysis and reporting\nHighly scalable for\nbuilder and developers\nRole-based access control to limit access to sensitive data\nAdmins\nAdministrating workspaces and report publishing\nManaging permissions and users access to data, reports, and dashboards\nCreators\nFast-track data shaping capabilities\nAdvanced analytics\nViewers\nSlice and dice the data by selecting cross filters across the visuals\nEasy report sharing to teams"
  }
]